{
  "positions": [
    {
      "title": "Associate Application Developer",
      "projects": ["Prophecy", "Network Service Planner (NSP)", "CMR"],
      "company": {
        "name": "Union Pacific Railroad"
      },
      "startYear": 2000,
      "startMonth": "March",
      "startDay": 20,
      "endYear": 2001,
      "endMonth": "January",
      "tasks": [
        "Created and automated Excel Workbooks for CMR",
        "Designed, developed and tested forecasting tool with Excel spreadsheets"
      ],
      "comments": []
    },
    {
      "title": "Application Developer",
      "projects": ["Prophecy", "Network Service Planner (NSP)", "CMR"],
      "startYear": 2001,
      "startMonth": "January",
      "endYear": 2002,
      "endMonth": "April",
      "tasks": [
        "Created and automated Excel Workbooks for CMR",
        "Designed, developed and tested forecasting tool with Excel spreadsheets"
      ]
    }
  ],
  "reviews": [
    {
      "year": 2000,
      "context": "annual review?",
      "manager": "John Chekal",
      "director": "Jim H. Fuller",
      "AVP/VP": "Phil Seifert",
      "responsibilities": [
        {
          "description": "Support Prophecy & Misc CMR",
          "tasks": [
            "Learning Prophecy form both a technical and a functional perspective",
            "Created and automated Excel Workbooks for CMR",
            "Develop, test, & implement importing and exporting of forecasts with spreadsheets",
            "Develop, test, & implement opportunity data base",
            "Forecast Accuracy. VB component",
            "Knocked out Prophecy 'Issues List'",
            "Prophecy maintenance & support",
            "Technical training for 2001 development"
          ]
        },
        {
          "description": "Additional Prophecy & CMR",
          "tasks": [
            "Create fully versioned & fully documented Prophecy System with documentation in ASK",
            "Convert Prophecy from VB5 to VB6 & upgrade 3rd party tools",
            "Sync up with change control group",
            "Ongoing Prophecy support and maintainence",
            "Enhance understanding of overall application"
          ]
        }
      ],
      "comments": [
        "Solid and consistent performer",
        "Good value system and strong work ethic",
        "Excellent technical aptitude",
        "Customer focused",
        "Learns quickly"
      ]
    },
    {
      "year": 2001,
      "context": "mid-year review?",
      "mid-year": true,
      "responsibilities": [
        {
          "description": "Ongoing Prophecy Support",
          "tasks": [
            "Ongoing programming support and maintainence",
            "Elective enhancements",
            "Customer Consultation"
          ]
        },
        {
          "description": "CSPA Contribution",
          "tasks": [
            "Stage 1 Support",
            "Stage 2 Support",
            "Technical Environment ResearcH",
            "Traffic Selection Research & Design"
          ]
        }
      ],
      "comments": [
        "Strengths: Technical Skills & Technical Aptitude",
        "Solid new age technical skill set, and good technical aptitude.",
        "A conscientious contributor",
        "Works well with customers",
        "Limited business knowledge",
        "Nees to seize opportunity to take on broader role",
        "Wants to contribute",
        "A good resource with excellent long term potential"
      ]
    },
    {
      "year": 2001,
      "context": "promotion justification",
      "author": "John Chekal",
      "position": "manager",
      "comments": [
        "Plays an instrumental hands-on technical role on a combination of Network Service Planner (NSP) and Prophecy. In this role, Adam provides a blend of analytical and technical skills to work efficiently and candidly with a demanding customer base. Adam is involved in an array of activities including problem analysis, data analysis, technical design, development, application configuration, deployment, customer consultation, trouble shooting, and normal day-to-day maintenance. He works primarily with JAVA, VB, and Oracle; and his project work involves working in a combination of technical environments.",
        "Adam continues to make significant contributions on both NSP and Prophecy. He's our primary developer on NSP's user interface, traffic sourcing, and reports. His recent NSP accomplishments have been many and include re-working the efficiency and look/feel of user interface, re-working all reports, expanding NSP's analytics, adding several new sandboxes, facilitating model rollout to wider audience of users, and providing support on special studies that allowed the initial Unified Plan analysis to get grounded. On Prophecy, Adam continues to Integrate Incremental enhancements. Recent activity has involved extending the import feature, integrating a new version of vsview, and expanding security on reports. He has also supported our internal requirements related to server migrations, etc, as well as provided day-to-day system maintenance. Adam's contributions have been critical to our success.",
        "Adam Koch is in definite need of a bump to Project Engineer. With expanding work loads in our area, he has recently inherited technical leadership for Prophecy, and his role in NSP is also being expanded to include ownership of several service matrix processes. He continues to play an instrumental role in all our activities surrounding NSP and Prophecy, both on existing support and on new development work, and the breath of his involvement continues to grow. Discussion above describes scope and roll of Adam's position.",
        "Adam is a very solid contributor. He has impressive educational credentials, possesses a strong technical aptitude, has good long term potential, and he consistently gets the job done. His genuine interest in adding value combined with his technical skill set clearly position him to provide a strong fit both now and in the future, and it's important we provide appropriate career development for him. It's been over three years since his last promotion, and considering his length of stay, level of contribution, and additional responsibilities; a promotion within band is in order."
      ]
    },
    {
      "year": 2005,
      "manager": "John Chekal",
      "context": "annual review?",
      "director": "Martin J. Malley",
      "AVP/VP": "Jeff Young",
      "status": "draft",
      "responsibilities": [
        {
          "description": "NSP - To work on the Network Schedule Planner (NSP) system by enhancing, fixing and maintaining the application as required. This includes hands-on programming of the Weblogic environment and the Unix NSP server",
          "tasks": [
            "Work on the fixes/enhancements listed in the NSP Discussion Database",
            "Enhance Car Scheduling engine to allow the scheduling of multiple scenarios",
            "Complete the graphical display (GIS) of car routes by the end of July",
            "Build a web service capable of handling a large (but undetermined) number of requests by the end of 2006",
            "Create standard process for \"special studies\"",
            "Generate train statistics from scenario (if decided to implement)",
            "Integrate equipment handling rules (if decided to implement)",
            "Tune application for quicker responses, specifically page displays and reports",
            "Take over Service Matrix (SM) responsibilities from Mark Mordeson",
            "Process automation: Automate loads of database and lookup-ups. Automate mainenance on ?? files",
            "Update NSP as required for any Infrastructure initiatives",
            "Keep all areas of deployment (development, test, and production) up-to-date and running",
            "Monitor the production environment for potential problems",
            "Provide time and services for any group that wishes to do a \"special study\"",
            "Support the customers with any issues or enhancements",
            "Provide information or support to other groups"
          ]
        },

        {
          "description": "Prophecy",
          "tasks": [
            "Enhance the application(s) per user requests, including ability to manually set the vintage id for the \"Revision\" vintage when rebuilding the summary table",
            "Coordinate efforts to deploy new versions of Prophecy to the users",
            "Migrate away from 3rd party controls to more standard Microsoft controls",
            "Enhance import feature to display more user feedback",
            "Help with the deployment of SAS and with the integation of SAS with Prophecy",
            "[More to do]"
          ]
        }
      ]
    },
    {
      "year": 2005,
      "manager": "John Chekal",
      "context": "annual review?",
      "director": "Martin J. Malley",
      "AVP/VP": "Jeff Young",
      "status": "pending",
      "responsibilities": [
        {
          "description": "Hands on NSP development and support",
          "tasks": [
            "Ongoing tuning and enhancement of traffic selection, saving, and management",
            "Ongoing tuning and enhancement of scenario management",
            "Reports: Ongoing tuning of existing reports",
            "Reports: Development of new reports",
            "Reports: Continued development of various drill down/in capabilities",
            "Ongoing tuning and enhancement of single trip",
            "Development of new features related analysis, reports, and financial impact analysis",
            "NSP queue of enhancements",
            "Provide customer consultation and support",
            "Technical support related to IT Infrastructure initiatives",
            "System Maintenance"
          ]
        },
        {
          "description": "Hands on Propehcy development/mainenance support. Miscellaneous ongoing fixes, enhancements, and maintainence",
          "tasks": [
            "Enhancements - Misc fine tuning",
            "Maintenance - Misc ongoing system COQ maintenance",
            "Support - Technical and analytic support for customers"
          ]
        }
      ]
    }
  ]
}
